In [1]:
import pandas as pd
# Load dataset
df = pd.read_csv('bank_transactions.csv')
df.head()

,TransactionID,CustomerID,CustomerDOB,CustGender,CustLocation,CustAccountBalance,TransactionDate,TransactionTime,TransactionAmount (INR)
0,T1,C5841053,10/1/94,F,JAMSHEDPUR,17819.05,2/8/16,143207,25.0
1,T2,C2142763,4/4/57,M,JHAJJAR,2270.69,2/8/16,141858,27999.0
2,T3,C4417068,26/11/96,F,MUMBAI,17874.44,2/8/16,142712,459.0
3,T4,C5342380,14/9/73,F,MUMBAI,866503.21,2/8/16,142714,2060.0
4,T5,C9031234,24/3/88,F,NAVI MUMBAI,6714.43,2/8/16,181156,1762.5

In [2]:
print("Original DataFrame Shape:", df.shape)
print(df.head())  # Show the first few rows

Original DataFrame Shape: (1048567, 9)
  TransactionID CustomerID CustomerDOB CustGender CustLocation  \
0            T1   C5841053     10/1/94          F   JAMSHEDPUR
1            T2   C2142763      4/4/57          M      JHAJJAR
2            T3   C4417068    26/11/96          F       MUMBAI
3            T4   C5342380     14/9/73          F       MUMBAI
4            T5   C9031234     24/3/88          F  NAVI MUMBAI

   CustAccountBalance TransactionDate  TransactionTime  \
0            17819.05          2/8/16           143207
1             2270.69          2/8/16           141858
2            17874.44          2/8/16           142712
3           866503.21          2/8/16           142714
4             6714.43          2/8/16           181156

   TransactionAmount (INR)
0                     25.0
1                  27999.0
2                    459.0
3                   2060.0
4                   1762.5

In [3]:
# Check for missing values
print(df.isnull().sum())

TransactionID                 0
CustomerID                    0
CustomerDOB                3397
CustGender                 1100
CustLocation                151
CustAccountBalance         2369
TransactionDate               0
TransactionTime               0
TransactionAmount (INR)       0
dtype: int64